// За допомогою циклу while вивести в консоль на екран
// всі числа від 1 до 20, крім чисел, кратних 3.

// Якщо зустрінете число, кратне 3,
// цикл повинен продовжити виконання
// за допомогою оператора continue.

let i = 1;

while (i <= 20) {
  // Умова: поки i менше або дорівнює 20
  if (i % 3 === 0) {
    // Перевіряємо, чи число кратне 3
    i++; // Збільшуємо значення i, щоб уникнути зациклення

    continue; // Пропускаємо ітерацію
  }

  console.log(i); // Виводимо число в консоль
  i++; // Збільшуємо значення i
}
